[Killed] EqualityOperator
main/components/Ride/RideAssignDriverForm.js:91:29
 
             
 
-            {driverShift && driverShift.length !== 0 &&
+            {driverShift && driverShift.length === 0 &&
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="shiftId">Shift Id</Form.Label>
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RideAssignDriverForm-shiftId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/Ride/RideAssignDriverForm.js:91:14
 
             
 
-            {driverShift && driverShift.length !== 0 &&
-            <Form.Group className="mb-3" >
-                <Form.Label htmlFor="shiftId">Shift Id</Form.Label>
-                <Form.Control 
-                    as="select" 
-                    type="select"
-                    data-testid={testIdPrefix + "-shiftId"}
-                    id="shiftId"
-                    isInvalid={Boolean(errors.shiftId)}
-                    {...register("shiftId", {
-                        required: "Shift Id is required."
-                    })}
-                    defaultValue={initialContents?.shiftId}
-                >
-                    {driverShift.map((shift) => (
-                        <option key={shift.id.toString()} value={shift.id.toString()}>
-                            {shift.id.toString() + " - " + shift.driverName + " - " + shift.day + " - " + shift.shiftStart + "-" + shift.shiftEnd}
-                        </option>
-                    ))}
-                </Form.Control>
-                <Form.Control.Feedback type="invalid">
-                    {errors.shiftId?.message}
-                </Form.Control.Feedback>
-            </Form.Group>}
+            {driverShift && driverShift.length !== 0 || <Form.Group className="mb-3">
+                <Form.Label htmlFor="shiftId">Shift Id</Form.Label>
+                <Form.Control as="select" type="select" data-testid={testIdPrefix + "-shiftId"} id="shiftId" isInvalid={Boolean(errors.shiftId)} {...register("shiftId", {
+    required: "Shift Id is required."
+  })} defaultValue={initialContents?.shiftId}>
+                    {driverShift.map(shift => <option key={shift.id.toString()} value={shift.id.toString()}>
+                            {shift.id.toString() + " - " + shift.driverName + " - " + shift.day + " - " + shift.shiftStart + "-" + shift.shiftEnd}
+                        </option>)}
+                </Form.Control>
+                <Form.Control.Feedback type="invalid">
+                    {errors.shiftId?.message}
+                </Form.Control.Feedback>
+            </Form.Group>}
 
             <Form.Group className="mb-3" >
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RideAssignDriverForm-shiftId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:100:34
                     data-testid={testIdPrefix + "-shiftId"}
                     id="shiftId"
                     isInvalid={Boolean(errors.shiftId)}
-                    {...register("shiftId", {
+                    {...register("", {
                         required: "Shift Id is required."
                     })}
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Survived] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:103:35
                     {...register("shiftId", {
                         required: "Shift Id is required."
                     })}
-                    defaultValue={initialContents?.shiftId}
+                    defaultValue={initialContents.shiftId}
                 >
                     {driverShift.map((shift) => (

[Killed] ArrowFunction
main/components/Ride/RideAssignDriverForm.js:105:38
                     })}
                     defaultValue={initialContents?.shiftId}
                 >
-                    {driverShift.map((shift) => (
-                        <option key={shift.id.toString()} value={shift.id.toString()}>
-                            {shift.id.toString() + " - " + shift.driverName + " - " + shift.day + " - " + shift.shiftStart + "-" + shift.shiftEnd}
-                        </option>
-                    ))}
+                    {driverShift.map(() => undefined)}
                 </Form.Control>
                 <Form.Control.Feedback type="invalid">
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  undefined

[Survived] StringLiteral
main/components/Ride/RideAssignDriverForm.js:107:126
                 >
                     {driverShift.map((shift) => (
                         <option key={shift.id.toString()} value={shift.id.toString()}>
-                            {shift.id.toString() + " - " + shift.driverName + " - " + shift.day + " - " + shift.shiftStart + "-" + shift.shiftEnd}
+                            {shift.id.toString() + " - " + shift.driverName + " - " + shift.day + " - " + shift.shiftStart + "" + shift.shiftEnd}
                         </option>
                     ))}

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:112:22
                     ))}
                 </Form.Control>
                 <Form.Control.Feedback type="invalid">
-                    {errors.shiftId?.message}
+                    {errors.shiftId.message}
                 </Form.Control.Feedback>
             </Form.Group>}
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:134:34
                     data-testid={testIdPrefix + "-start"}
                     id="start"
                     type="text"
-                    {...register("start")}
+                    {...register("")}
                     disabled
                     defaultValue={initialContents?.startTime}
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:172:34
                     id="pickupRoom"
                     type="text"
                     isInvalid={Boolean(errors.pickupRoom)}
-                    {...register("pickupRoom")}
+                    {...register("")}
                     disabled
                     defaultValue={initialContents?.pickupRoom} 
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:207:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="course">Course Number</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-course"}
+                    data-testid={testIdPrefix + ""}
                     id="course"
                     type="text"
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideAssignDriverForm-course"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
