[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:9:5
 
 function isParticipant(currentUser) {
   return (
-    hasRole(currentUser, "ROLE_ADMIN")
-    || hasRole(currentUser, "ROLE_DRIVER")
-    || hasRole(currentUser, "ROLE_RIDER")
+    (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_DRIVER")) && hasRole(currentUser, "ROLE_RIDER")
   );
 }
killedBy: AppNavbar tests renders shift table links correctly for rider
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-ride-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:78:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/driverAvailability">Driver Availabilities</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/applications/riders">Rider Applications</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
+                    <NavDropdown.Item as={Link} to="/admin/driverAvailability">Driver Availabilities</NavDropdown.Item>
+                    <NavDropdown.Item as={Link} to="/admin/applications/riders">Rider Applications</NavDropdown.Item>
+                  </NavDropdown>
               }
               {

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:94:18
                 )
               }
               {
-                (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_DRIVER")) && (
+                (hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_DRIVER")) && (
                   <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
                     <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:94:18
                 )
               }
               {
-                (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_DRIVER")) && (
+                (true) && (
                   <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
                     <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:117:18
                 )
               }
               {
-                (hasRole(currentUser, "ROLE_DRIVER") || hasRole(currentUser, "ROLE_ADMIN")) && (
+                (true) && (
                   <Nav.Link id ="appnavbar-driver-link" data-testid="appnavbar-driver" as={Link} to="/drivers/list">Drivers Page</Nav.Link>
                 )
