[Killed] ObjectLiteral
main/components/Ride/RideAssignDriverForm.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/drivers/all`],
-            {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/drivers/all`
-                // Stryker restore all
-            },
+            {},
         );
 
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  undefined

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:17:22
             [`/api/drivers/all`],
             {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
                 method: "GET",
-                url: `/api/drivers/all`
+                url: ``
                 // Stryker restore all
             },
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  undefined

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:28:22
             [`/api/shift/all`],
             {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
                 method: "GET",
-                url: `/api/shift/all`
+                url: ``
                 // Stryker restore all
             },
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  undefined

[Killed] ArrayDeclaration
main/components/Ride/RideAssignDriverForm.js:33:52
             },
         );
 
-    const [driverShift, setDriverShift] = useState([]);
+    const [driverShift, setDriverShift] = useState(["Stryker was here"]);
 
     // Stryker disable all
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')

[Killed] ConditionalExpression
main/components/Ride/RideAssignDriverForm.js:75:14
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        defaultValue={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3" >
killedBy: RideAssignDriverForm tests renders correctly when passing in initialContents
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  object
Received has value: {}

<html>
  <head />

[Killed] LogicalOperator
main/components/Ride/RideAssignDriverForm.js:75:14
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        defaultValue={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="id">Id</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} defaultValue={initialContents.id} disabled />
+                </Form.Group>}
 
             <Form.Group className="mb-3" >
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:96:34
                     type="select"
                     data-testid={testIdPrefix + "-shiftId"}
                     id="shiftId"
-                    {...register("shiftId")}
+                    {...register("")}
                     defaultValue={initialContents?.shiftId}
                 >
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:97:35
                     data-testid={testIdPrefix + "-shiftId"}
                     id="shiftId"
                     {...register("shiftId")}
-                    defaultValue={initialContents?.shiftId}
+                    defaultValue={initialContents.shiftId}
                 >
                     {driverShift && driverShift.map((shift) => (
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'shiftId')

[Killed] LogicalOperator
main/components/Ride/RideAssignDriverForm.js:99:22
                     {...register("shiftId")}
                     defaultValue={initialContents?.shiftId}
                 >
-                    {driverShift && driverShift.map((shift) => (
-                        <option key={shift.id.toString()} data-testid={testIdPrefix + "-shiftId-" + shift.id.toString()} value={shift.id.toString()}>
-                            {shift.id.toString() + " - " + shift.driverName + " - " + shift.day + " " + shift.shiftStart + "-" + shift.shiftEnd}
-                        </option>
-                    ))}
+                    {driverShift || driverShift.map(shift => <option key={shift.id.toString()} data-testid={testIdPrefix + "-shiftId-" + shift.id.toString()} value={shift.id.toString()}>
+                            {shift.id.toString() + " - " + shift.driverName + " - " + shift.day + " " + shift.shiftStart + "-" + shift.shiftEnd}
+                        </option>)}
                 </Form.Control>
             </Form.Group>
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, driverName, day, shiftStart, shiftEnd}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Ride/RideAssignDriverForm.js:99:22
                     {...register("shiftId")}
                     defaultValue={initialContents?.shiftId}
                 >
-                    {driverShift && driverShift.map((shift) => (
-                        <option key={shift.id.toString()} data-testid={testIdPrefix + "-shiftId-" + shift.id.toString()} value={shift.id.toString()}>
-                            {shift.id.toString() + " - " + shift.driverName + " - " + shift.day + " " + shift.shiftStart + "-" + shift.shiftEnd}
-                        </option>
-                    ))}
+                    {false}
                 </Form.Control>
             </Form.Group>
killedBy: RideAssignDriverForm tests renders correctly when passing in initialContents
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  object
Received has value: {}

<html>
  <head />

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:115:35
                     isInvalid={Boolean(errors.day)}
                     {...register("day")}
                     disabled
-                    defaultValue={initialContents?.day}
+                    defaultValue={initialContents.day}
                 />
             </Form.Group>
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'day')

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:127:35
                     type="text"
                     {...register("start")}
                     disabled
-                    defaultValue={initialContents?.startTime}
+                    defaultValue={initialContents.startTime}
                 />
             </Form.Group>
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'startTime')

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:137:34
                     data-testid={testIdPrefix + "-end"}
                     id="end"
                     type="text"
-                    {...register("end")}
+                    {...register("")}
                     disabled
                     defaultValue={initialContents?.endTime}     
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:139:35
                     type="text"
                     {...register("end")}
                     disabled
-                    defaultValue={initialContents?.endTime}     
+                    defaultValue={initialContents.endTime}     
                 />
             </Form.Group>
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'endTime')

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:146:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="pickupBuilding">Pick Up Building</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-pickupBuilding"}
+                    data-testid={testIdPrefix + ""}
                     id="pickupBuilding"
                     type="text"
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideAssignDriverForm-pickupBuilding"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:152:35
                     isInvalid={Boolean(errors.pickupBuilding)}
                     {...register("pickupBuilding")}
                     disabled
-                    defaultValue={initialContents?.pickupBuilding} 
+                    defaultValue={initialContents.pickupBuilding} 
                 />
             </Form.Group>
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'pickupBuilding')

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:159:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="pickupRoom">Room Number for Pickup</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-pickupRoom"}
+                    data-testid={testIdPrefix + ""}
                     id="pickupRoom"
                     type="text"
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideAssignDriverForm-pickupRoom"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:165:35
                     isInvalid={Boolean(errors.pickupRoom)}
                     {...register("pickupRoom")}
                     disabled
-                    defaultValue={initialContents?.pickupRoom} 
+                    defaultValue={initialContents.pickupRoom} 
                 />
             </Form.Group>
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'pickupRoom')

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:172:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="dropoffBuilding">Drop Off Building</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-dropoffBuilding"}
+                    data-testid={testIdPrefix + ""}
                     id="dropoffBuilding"
                     type="text"
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideAssignDriverForm-dropoffBuilding"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:178:35
                     isInvalid={Boolean(errors.dropoffBuilding)}
                     {...register("dropoffBuilding")}
                     disabled
-                    defaultValue={initialContents?.dropoffBuilding}
+                    defaultValue={initialContents.dropoffBuilding}
                 />
             </Form.Group>
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'dropoffBuilding')

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:185:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="dropoffRoom">Room Number for Dropoff</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-dropoffRoom"}
+                    data-testid={testIdPrefix + ""}
                     id="dropoffRoom"
                     type="text"
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideAssignDriverForm-dropoffRoom"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:191:35
                     isInvalid={Boolean(errors.dropoffRoom)}
                     {...register("dropoffRoom")}
                     disabled
-                    defaultValue={initialContents?.dropoffRoom} 
+                    defaultValue={initialContents.dropoffRoom} 
                 />
             </Form.Group>
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'dropoffRoom')

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:204:35
                     isInvalid={Boolean(errors.course)}
                     {...register("course")}
                     disabled
-                    defaultValue={initialContents?.course} 
+                    defaultValue={initialContents.course} 
                 />
             </Form.Group>
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'course')

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:215:34
                     id="notes"
                     type="text"
                     isInvalid={Boolean(errors.notes)}
-                    {...register("notes")}
+                    {...register("")}
                     disabled
                     defaultValue={initialContents?.notes} 
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Ride/RideAssignDriverForm.js:217:35
                     isInvalid={Boolean(errors.notes)}
                     {...register("notes")}
                     disabled
-                    defaultValue={initialContents?.notes} 
+                    defaultValue={initialContents.notes} 
                 />
             </Form.Group>
killedBy: RideAssignDriverForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'notes')
