[Killed] BooleanLiteral
main/components/Nav/AppNavbar.js:130:50
                 )
               }
               {
-                currentUser.loggedIn === true && !hasRole(currentUser, "ROLE_RIDER") && (
+                currentUser.loggedIn === true && hasRole(currentUser, "ROLE_RIDER") && (
                   <Nav.Link id ="appnavbar-applytobearider-link" data-testid="appnavbar-applytoberider" as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
                 )
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:130:17
                 )
               }
               {
-                currentUser.loggedIn === true && !hasRole(currentUser, "ROLE_RIDER") && (
-                  <Nav.Link id ="appnavbar-applytobearider-link" data-testid="appnavbar-applytoberider" as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                false
               }
 
