[Killed] ConditionalExpression
main/components/Shift/ShiftForm.js:33:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
             
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        name="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3">
killedBy: ShiftForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="ShiftForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:57:35
                     name="day"
                     isInvalid={Boolean(errors.day)}
                     {...register("day", {
-                        required: "Day is required."
+                        required: ""
                     })}
                 >
killedBy: ShiftForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Day is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Shift/ShiftForm.js:83:48
                     type="text"
                     placeholder="HH:MMAM/PM e.g. 11:00AM"
                     isInvalid={Boolean(errors.shiftStart)}
-                    {...register("shiftStart", {
-                        required: "Shift start time is required.",
-                        pattern: {
-                            value: /^(0[0-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Invalid time format."
-                        }
-                    })}
+                    {...register("shiftStart", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: ShiftForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Shift start time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Shift/ShiftForm.js:85:34
                     isInvalid={Boolean(errors.shiftStart)}
                     {...register("shiftStart", {
                         required: "Shift start time is required.",
-                        pattern: {
-                            value: /^(0[0-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Invalid time format."
-                        }
+                        pattern: {}
                     })}
                 />
killedBy: ShiftForm tests validates time format
statusReason: Error: Unable to find an element with the text: /Invalid time format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/Shift/ShiftForm.js:86:36
                     {...register("shiftStart", {
                         required: "Shift start time is required.",
                         pattern: {
-                            value: /^(0[0-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /^(0[0-9]|1[0-2]):[^0-5][0-9](AM|PM)$/,
                             message: "Invalid time format."
                         }
killedBy: ShiftForm tests invalidates incorrect time formats from mutations
statusReason: Error: Unable to find an element with the text: /Invalid time format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/Shift/ShiftForm.js:86:36
                     {...register("shiftStart", {
                         required: "Shift start time is required.",
                         pattern: {
-                            value: /^(0[0-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /^(0[^0-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
                             message: "Invalid time format."
                         }
killedBy: ShiftForm tests validates time format with character anomalies
statusReason: Error: Unable to find an element with the text: /Invalid time format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/Shift/ShiftForm.js:108:36
                     {...register("shiftEnd", {
                         required: "Shift end time is required.",
                         pattern: {
-                            value: /^(0[0-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /^(0[0-9]|1[^0-2]):[0-5][0-9](AM|PM)$/,
                             message: "Invalid time format."
                         }
killedBy: ShiftForm tests invalidates incorrect time formats from mutations
statusReason: Error: Unable to find an element with the text: /Invalid time format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:126:34
                     name="driverID"
                     as="select"
                     type="select"
-                    {...register("driverID")}
+                    {...register("")}
                 >
                     {drivers && drivers.map(driver => (
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ArrowFunction
main/components/Shift/ShiftForm.js:128:45
                     type="select"
                     {...register("driverID")}
                 >
-                    {drivers && drivers.map(driver => (
-                        <option key={driver.id} data-testid={testIdPrefix + "-driverID-" + driver.id} value={driver.id}>
-                            {driver.id + " - " + driver.fullName}
-                        </option>
-                    ))}
+                    {drivers && drivers.map(() => undefined)}
                 </Form.Control>
             </Form.Group>
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  undefined

[Killed] ConditionalExpression
main/components/Shift/ShiftForm.js:128:22
                     type="select"
                     {...register("driverID")}
                 >
-                    {drivers && drivers.map(driver => (
-                        <option key={driver.id} data-testid={testIdPrefix + "-driverID-" + driver.id} value={driver.id}>
-                            {driver.id + " - " + driver.fullName}
-                        </option>
-                    ))}
+                    {false}
                 </Form.Control>
             </Form.Group>
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-driverID-1"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:144:34
                     name="driverBackupID"
                     as="select"
                     type="select"
-                    {...register("driverBackupID")}
+                    {...register("")}
                 >
                     {drivers && drivers.map(driver => (
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/Shift/ShiftForm.js:146:22
                     type="select"
                     {...register("driverBackupID")}
                 >
-                    {drivers && drivers.map(driver => (
-                        <option key={driver.id} data-testid={testIdPrefix + "-driverBackupID-" + driver.id} value={driver.id}>
-                            {driver.id + " - " + driver.fullName}
-                        </option>
-                    ))}
+                    {true}
                 </Form.Control>
             </Form.Group>
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-driverBackupID-1"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Shift/ShiftForm.js:146:22
                     type="select"
                     {...register("driverBackupID")}
                 >
-                    {drivers && drivers.map(driver => (
-                        <option key={driver.id} data-testid={testIdPrefix + "-driverBackupID-" + driver.id} value={driver.id}>
-                            {driver.id + " - " + driver.fullName}
-                        </option>
-                    ))}
+                    {drivers || drivers.map(driver => <option key={driver.id} data-testid={testIdPrefix + "-driverBackupID-" + driver.id} value={driver.id}>
+                            {driver.id + " - " + driver.fullName}
+                        </option>)}
                 </Form.Control>
             </Form.Group>
killedBy: ShiftForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'map')
