[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:17:5
 
 function hasChat(currentUser) {
   return (
-    hasRole(currentUser, "ROLE_ADMIN")
-    || hasRole(currentUser, "ROLE_DRIVER")
+    true
   );
 }

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:41:9
   return (
     <>
       {
-        (currentUrl.startsWith("http://localhost:3000") || currentUrl.startsWith("http://127.0.0.1:3000")) && (
-          <AppNavbarLocalhost url={currentUrl} />
-        )
+        false
       }
 
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:78:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/driverAvailability">Driver Availabilities</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/applications/riders">Rider Applications</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/schedule">Schedule</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
+                    <NavDropdown.Item as={Link} to="/admin/driverAvailability">Driver Availabilities</NavDropdown.Item>
+                    <NavDropdown.Item as={Link} to="/admin/applications/riders">Rider Applications</NavDropdown.Item>
+                    <NavDropdown.Item as={Link} to="/admin/schedule">Schedule</NavDropdown.Item>
+                  </NavDropdown>
               }
               {

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:78:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/driverAvailability">Driver Availabilities</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/applications/riders">Rider Applications</NavDropdown.Item>
-                    <NavDropdown.Item as={Link} to="/admin/schedule">Schedule</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:88:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && (
-                  <NavDropdown title="Driver Dashboard" id="appnavbar-driver-dropdown" data-testid="appnavbar-driver-dropdown" >
-                  <NavDropdown.Item as={Link} to="/drivershifts">Dashboard</NavDropdown.Item>
-                </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_DRIVER") || <NavDropdown title="Driver Dashboard" id="appnavbar-driver-dropdown" data-testid="appnavbar-driver-dropdown">
+                  <NavDropdown.Item as={Link} to="/drivershifts">Dashboard</NavDropdown.Item>
+                </NavDropdown>
               }
               {

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:95:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && !hasRole(currentUser, "ROLE_DRIVER") && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:95:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && !hasRole(currentUser, "ROLE_DRIVER") && (
+                hasRole(currentUser, "ROLE_ADMIN") || !hasRole(currentUser, "ROLE_DRIVER") && (
                   <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
                     <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:102:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                    <NavDropdown.Item data-testid="appnavbar-availability-dropdown-availabilities" as={Link} to="/availability/">Availability</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_DRIVER") && isParticipant(currentUser) || <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown">
+                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
+                    <NavDropdown.Item data-testid="appnavbar-availability-dropdown-availabilities" as={Link} to="/availability/">Availability</NavDropdown.Item>
+                  </NavDropdown>
               }
               {

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:102:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_DRIVER") && isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                    <NavDropdown.Item data-testid="appnavbar-availability-dropdown-availabilities" as={Link} to="/availability/">Availability</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:125:17
                 )
               }
               {
-                (hasRole(currentUser, "ROLE_DRIVER") || hasRole(currentUser, "ROLE_ADMIN")) && (
-                  <Nav.Link id ="appnavbar-driver-link" data-testid="appnavbar-driver" as={Link} to="/drivers/list">Drivers Page</Nav.Link>
-                )
+                true
               }
               {

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:125:17
                 )
               }
               {
-                (hasRole(currentUser, "ROLE_DRIVER") || hasRole(currentUser, "ROLE_ADMIN")) && (
-                  <Nav.Link id ="appnavbar-driver-link" data-testid="appnavbar-driver" as={Link} to="/drivers/list">Drivers Page</Nav.Link>
-                )
+                false
               }
               {

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:130:17
                 )
               }
               {
-                currentUser.loggedIn === true && !hasRole(currentUser, "ROLE_RIDER") && (
+                currentUser.loggedIn === true || !hasRole(currentUser, "ROLE_RIDER") && (
                   <Nav.Link id ="appnavbar-applytobearider-link" data-testid="appnavbar-applytoberider" as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
                 )
killedBy: AppNavbar tests Apply to be a rider should not appear for rider users
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="nav-link" data-testid="appnavbar-applytoberider" href="/apply/rider" id="appnavbar-applytobearider-link">Apply to be a Rider</a> instead

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:130:17
                 )
               }
               {
-                currentUser.loggedIn === true && !hasRole(currentUser, "ROLE_RIDER") && (
-                  <Nav.Link id ="appnavbar-applytobearider-link" data-testid="appnavbar-applytoberider" as={Link} to="/apply/rider">Apply to be a Rider</Nav.Link>
-                )
+                true
               }
 
killedBy: AppNavbar tests renders RiderApplicationMember links correctly for member
statusReason: Error: Unable to find an element with the text: Apply to be a Rider. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
