[Killed] ConditionalExpression
main/components/Driver/DriverAvailabilityForm.js:20:14
     const testIdPrefix = "DriverAvailabilityForm";
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="driverId">driverId</Form.Label>
killedBy: DriverAvailabilityForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Driver/DriverAvailabilityForm.js:20:14
     const testIdPrefix = "DriverAvailabilityForm";
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">id</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="driverId">driverId</Form.Label>
killedBy: DriverAvailabilityForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:52:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="day">Day of Week</Form.Label>
                 <Form.Select
-                    data-testid={testIdPrefix + "-day"}
+                    data-testid={testIdPrefix + ""}
                     id="day"
                     isInvalid={Boolean(errors.day)}
killedBy: DriverAvailabilityForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-day"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:76:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="startTime">Availability Start</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-startTime"}
+                    data-testid={testIdPrefix + ""}
                     id="startTime"
                     type="text"
killedBy: DriverAvailabilityForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-startTime"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:80:47
                     id="startTime"
                     type="text"
                     isInvalid={Boolean(errors.startTime)}
-                    {...register("startTime", {
-                        required: "Availability Start is required.",
-                        pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Please enter start time in the format HH:MM AM/PM (e.g., 3:30PM)."
-                          }
-                    })}
+                    {...register("startTime", {})}
                     placeholder="Enter time in the format HH:MM AM/PM (e.g. 3:30PM)"
                     defaultValue={initialContents?.startTime}
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Availability Start is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/Driver/DriverAvailabilityForm.js:83:36
                     {...register("startTime", {
                         required: "Availability Start is required.",
                         pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /^(0?[1-9]|1[^0-2]):[0-5][0-9](AM|PM)$/,
                             message: "Please enter start time in the format HH:MM AM/PM (e.g., 3:30PM)."
                           }
killedBy: DriverAvailabilityCreatePage tests on submit, makes request to backend, and redirects to /availability
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:102:34
                     id="endTime"
                     type="text"
                     isInvalid={Boolean(errors.endTime)}
-                    {...register("endTime", {
+                    {...register("", {
                         required: "Availability End is required.",
                         pattern: {
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:102:45
                     id="endTime"
                     type="text"
                     isInvalid={Boolean(errors.endTime)}
-                    {...register("endTime", {
-                        required: "Availability End is required.",
-                        pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Please enter end time in the format HH:MM AM/PM (e.g., 3:30PM)."
-                          }
-                    })}
+                    {...register("endTime", {})}
                     placeholder="Enter time in the format HH:MM AM/PM (e.g. 3:30PM)"
                     defaultValue={initialContents?.endTime}
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Availability End is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/Driver/DriverAvailabilityForm.js:105:36
                     {...register("endTime", {
                         required: "Availability End is required.",
                         pattern: {
-                            value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
+                            value: /(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
                             message: "Please enter end time in the format HH:MM AM/PM (e.g., 3:30PM)."
                           }
killedBy: DriverAvailabilityForm tests enter wrong time format
statusReason: TestingLibraryElementError: Unable to find an element with the text: Please enter end time in the format HH:MM AM/PM (e.g., 3:30PM).. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:106:38
                         required: "Availability End is required.",
                         pattern: {
                             value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
-                            message: "Please enter end time in the format HH:MM AM/PM (e.g., 3:30PM)."
+                            message: ""
                           }
                     })}
killedBy: DriverAvailabilityForm tests enter wrong time format
statusReason: TestingLibraryElementError: Unable to find an element with the text: Please enter end time in the format HH:MM AM/PM (e.g., 3:30PM).. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Driver/DriverAvailabilityForm.js:127:35
                     {...register("notes", {
                     })}
                     placeholder="e.g. Busy on Monday"  
-                    defaultValue={initialContents?.notes} 
+                    defaultValue={initialContents.notes} 
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'notes')
