[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:66:35
                     type="text"
                     isInvalid={Boolean(errors.startTime)}
                     {...register("startTime", {
-                        required: "Availability Start is required.",
+                        required: "",
                         pattern: {
                             value: /^(0?[1-9]|1[0-2]):[0-5][0-9](AM|PM)$/,
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Availability Start is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
