[Killed] StringLiteral
main/components/Ride/RideTable.js:111:23
         },
         {
             Header: 'Shift',
-            accessor: 'shiftId',
+            accessor: "",
             Cell: ({ value }) => (
                 // Stryker disable next-line all : hard to set up test
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-shiftId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:149:9
             Header: 'Notes',
             accessor: 'notes',
         },
-        {
-            Header: 'Status',
-            accessor: 'status'
-        }
+        {}
     ];
 
killedBy: RideTable tests renders without crashing for empty table for driver
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:150:21
             accessor: 'notes',
         },
         {
-            Header: 'Status',
+            Header: "",
             accessor: 'status'
         }
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: Status. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrayDeclaration
main/components/Ride/RideTable.js:209:32
         ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
     ]
 
-    const buttonColumnsAdmin = [
-        ...columns,
-        ButtonColumn("Edit", "primary", editCallback, "RideTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RideTable"),
-        ButtonColumn("Assign Driver", "success", assignCallback, "RideTable")
-    ]
+    const buttonColumnsAdmin = []
 
    
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
