[Killed] ArrayDeclaration
main/components/Ride/RideTable.js:195:32
     ];
 
 
-    const buttonColumnsRider = [
-        ...columnsRider,
-        ButtonColumn("Edit", "primary", editCallback, "RideTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
-    ]
+    const buttonColumnsRider = []
 
     const buttonColumnsAdmin = [
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:198:32
     const buttonColumnsRider = [
         ...columnsRider,
         ButtonColumn("Edit", "primary", editCallback, "RideTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
+        ButtonColumn("Delete", "", deleteCallback, "RideTable")
     ]
 
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/Ride/RideTable.js:209:112
     ]
 
    
-    const columnsToDisplay = (hasRole(currentUser, "ROLE_ADMIN")) ? buttonColumnsAdmin : (hasRole(currentUser, "ROLE_DRIVER")) ? columnsDriver: buttonColumnsRider;
+    const columnsToDisplay = (hasRole(currentUser, "ROLE_ADMIN")) ? buttonColumnsAdmin : (hasRole(currentUser, "")) ? columnsDriver: buttonColumnsRider;
     
     
killedBy: RideTable tests Has the expected column headers and content for ordinary driver
statusReason: TestingLibraryElementError: Unable to find an element with the text: Student. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
