[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:67:18
         );
 
     const editRideCallback = (ride) => {
-        navigate(`/ride/edit/${ride.id}`)
+        navigate(``)
     }
 
killedBy: SchedulerPage tests ride action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:115:12
     const deleteDriverCallback = async (driver) => { DriverDeleteMutation.mutate({row: {values: {id: driver.id}}}); }
 
     const eventLink = () => {
-        if(page === "shifts" && shifts !== undefined) {
+        if(true) {
             return {
                 event: 
killedBy: SchedulerPage if backend is not working renders default without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:115:12
     const deleteDriverCallback = async (driver) => { DriverDeleteMutation.mutate({row: {values: {id: driver.id}}}); }
 
     const eventLink = () => {
-        if(page === "shifts" && shifts !== undefined) {
+        if(true && shifts !== undefined) {
             return {
                 event: 
killedBy: SchedulerPage tests navigates to wrong page
statusReason: Error: expect(element).not.toBeInTheDocument()


<html>
  <head />
  <body>
    <div>

[Killed] ObjectLiteral
main/pages/Scheduler/SchedulerPage.js:116:20
 
     const eventLink = () => {
         if(page === "shifts" && shifts !== undefined) {
-            return {
-                event: 
-                    shifts.map(shift => ({
-                        id: shift.id,
-                        title: `Shift for Driver ${shift.driverID}`,
-                        // Stryker disable next-line all : hard to test for specific description
-                        description: `Backup Driver: ${shift.driverBackupID}`,
-                        day: shift.day,
-                        startTime: shift.shiftStart,
-                        endTime: shift.shiftEnd,
-                        actions: [
-                            { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
-                            { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
-                            { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
-                        ]
-                    })),
-                createLink: "/shift/create"
-            }
+            return {}
         }
         else if(page === "rides" && ride_request !== undefined) {
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: Unable to find an element with the text: Shift for Driver 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:118:32
         if(page === "shifts" && shifts !== undefined) {
             return {
                 event: 
-                    shifts.map(shift => ({
-                        id: shift.id,
-                        title: `Shift for Driver ${shift.driverID}`,
-                        // Stryker disable next-line all : hard to test for specific description
-                        description: `Backup Driver: ${shift.driverBackupID}`,
-                        day: shift.day,
-                        startTime: shift.shiftStart,
-                        endTime: shift.shiftEnd,
-                        actions: [
-                            { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
-                            { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
-                            { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
-                        ]
-                    })),
+                    shifts.map(() => undefined),
                 createLink: "/shift/create"
             }
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: TypeError: Cannot read properties of undefined (reading 'day')

[Killed] ObjectLiteral
main/pages/Scheduler/SchedulerPage.js:118:42
         if(page === "shifts" && shifts !== undefined) {
             return {
                 event: 
-                    shifts.map(shift => ({
-                        id: shift.id,
-                        title: `Shift for Driver ${shift.driverID}`,
-                        // Stryker disable next-line all : hard to test for specific description
-                        description: `Backup Driver: ${shift.driverBackupID}`,
-                        day: shift.day,
-                        startTime: shift.shiftStart,
-                        endTime: shift.shiftEnd,
-                        actions: [
-                            { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
-                            { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
-                            { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
-                        ]
-                    })),
+                    shifts.map(shift => ({})),
                 createLink: "/shift/create"
             }
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: Unable to find an element with the text: Shift for Driver 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:127:37
                         startTime: shift.shiftStart,
                         endTime: shift.shiftEnd,
                         actions: [
-                            { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
+                            { text: "", variant: "primary", callback: () => editShiftCallback(shift) },
                             { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
                             { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: Error: Unable to find an element with the text: Edit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/Scheduler/SchedulerPage.js:129:29
                         actions: [
                             { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
                             { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
-                            { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
+                            {}
                         ]
                     })),
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: TestingLibraryElementError: Unable to find an element with the text: Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] EqualityOperator
main/pages/Scheduler/SchedulerPage.js:135:37
                 createLink: "/shift/create"
             }
         }
-        else if(page === "rides" && ride_request !== undefined) {
+        else if(page === "rides" && ride_request === undefined) {
             return {
                 event:
killedBy: SchedulerPage if backend is not working navigates to ride requests and loads ride events
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:135:37
                 createLink: "/shift/create"
             }
         }
-        else if(page === "rides" && ride_request !== undefined) {
+        else if(page === "rides" && true) {
             return {
                 event:
killedBy: SchedulerPage if backend is not working navigates to ride requests and loads ride events
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:138:38
         else if(page === "rides" && ride_request !== undefined) {
             return {
                 event:
-                    ride_request.map(request => ({
-                        id: request.id,
-                        title: `Ride Request for ${request.student}`,
-                        // Stryker disable next-line all : hard to test for specific description
-                        description: `From ${request.pickupBuilding} to ${request.dropoffBuilding}`,
-                        day: request.day,
-                        startTime: request.startTime,
-                        endTime: request.endTime,
-                        actions: [
-                            { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
-                            { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
-                            { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
-                        ]
-                    })),
+                    ride_request.map(() => undefined),
                 createLink: "/ride/create"
             }
killedBy: SchedulerPage tests navigates to ride requests and loads ride events
statusReason: TypeError: Cannot read properties of undefined (reading 'day')

[Killed] ObjectLiteral
main/pages/Scheduler/SchedulerPage.js:138:50
         else if(page === "rides" && ride_request !== undefined) {
             return {
                 event:
-                    ride_request.map(request => ({
-                        id: request.id,
-                        title: `Ride Request for ${request.student}`,
-                        // Stryker disable next-line all : hard to test for specific description
-                        description: `From ${request.pickupBuilding} to ${request.dropoffBuilding}`,
-                        day: request.day,
-                        startTime: request.startTime,
-                        endTime: request.endTime,
-                        actions: [
-                            { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
-                            { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
-                            { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
-                        ]
-                    })),
+                    ride_request.map(request => ({})),
                 createLink: "/ride/create"
             }
killedBy: SchedulerPage tests navigates to ride requests and loads ride events
statusReason: Error: Unable to find an element with the text: Ride Request for CGaucho. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:147:54
                         startTime: request.startTime,
                         endTime: request.endTime,
                         actions: [
-                            { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
+                            { text: "Edit", variant: "", callback: () => editRideCallback(request) },
                             { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
                             { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
killedBy: SchedulerPage tests ride action buttons trigger correct callbacks
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] ObjectLiteral
main/pages/Scheduler/SchedulerPage.js:148:29
                         endTime: request.endTime,
                         actions: [
                             { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
-                            { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
+                            {},
                             { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
                         ]
killedBy: SchedulerPage tests ride action buttons trigger correct callbacks
statusReason: TestingLibraryElementError: Unable to find an element with the text: Delete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:149:37
                         actions: [
                             { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
                             { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
-                            { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
+                            { text: "", variant: "success", callback: () => assignRideCallback(request) }
                         ]
                     })),
killedBy: SchedulerPage tests ride action buttons trigger correct callbacks
statusReason: TestingLibraryElementError: Unable to find an element with the text: Assign Driver. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:155:17
                 createLink: "/ride/create"
             }
         }
-        else if(page === "driver" && driverAvailability !== undefined) {
+        else if(false) {
             return {
                 event:
killedBy: SchedulerPage tests navigates to driver availability and loads availability events
statusReason: Error: Unable to find an element with the text: Availability for Driver 4. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] EqualityOperator
main/pages/Scheduler/SchedulerPage.js:155:17
                 createLink: "/ride/create"
             }
         }
-        else if(page === "driver" && driverAvailability !== undefined) {
+        else if(page !== "driver" && driverAvailability !== undefined) {
             return {
                 event:
killedBy: SchedulerPage tests navigates to wrong page
statusReason: Error: expect(element).not.toBeInTheDocument()


<html>
  <head />
  <body>
    <div>

[Killed] ObjectLiteral
main/pages/Scheduler/SchedulerPage.js:156:20
             }
         }
         else if(page === "driver" && driverAvailability !== undefined) {
-            return {
-                event:
-                    driverAvailability.map(availability => ({
-                        id: availability.id,
-                        title: `Availability for Driver ${availability.driverId}`,
-                        description: availability.notes,
-                        day: availability.day,
-                        startTime: availability.startTime,
-                        endTime: availability.endTime,
-                        actions: [  
-                            { text: "Delete", variant: "danger", callback: () => {deleteDriverCallback(availability); navigate(0)} },
-                            { text: "Review", variant: "success", callback: () => reviewDriverCallback(availability) }
-                        ]
-                    })),
-                createLink: "/availability/create"
-            }
+            return {}
         }
         return {}
killedBy: SchedulerPage tests navigates to driver availability and loads availability events
statusReason: Error: Unable to find an element with the text: Availability for Driver 4. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:158:44
         else if(page === "driver" && driverAvailability !== undefined) {
             return {
                 event:
-                    driverAvailability.map(availability => ({
-                        id: availability.id,
-                        title: `Availability for Driver ${availability.driverId}`,
-                        description: availability.notes,
-                        day: availability.day,
-                        startTime: availability.startTime,
-                        endTime: availability.endTime,
-                        actions: [  
-                            { text: "Delete", variant: "danger", callback: () => {deleteDriverCallback(availability); navigate(0)} },
-                            { text: "Review", variant: "success", callback: () => reviewDriverCallback(availability) }
-                        ]
-                    })),
+                    driverAvailability.map(() => undefined),
                 createLink: "/availability/create"
             }
killedBy: SchedulerPage tests navigates to driver availability and loads availability events
statusReason: TypeError: Cannot read properties of undefined (reading 'day')

[Killed] ObjectLiteral
main/pages/Scheduler/SchedulerPage.js:158:61
         else if(page === "driver" && driverAvailability !== undefined) {
             return {
                 event:
-                    driverAvailability.map(availability => ({
-                        id: availability.id,
-                        title: `Availability for Driver ${availability.driverId}`,
-                        description: availability.notes,
-                        day: availability.day,
-                        startTime: availability.startTime,
-                        endTime: availability.endTime,
-                        actions: [  
-                            { text: "Delete", variant: "danger", callback: () => {deleteDriverCallback(availability); navigate(0)} },
-                            { text: "Review", variant: "success", callback: () => reviewDriverCallback(availability) }
-                        ]
-                    })),
+                    driverAvailability.map(availability => ({})),
                 createLink: "/availability/create"
             }
killedBy: SchedulerPage tests navigates to driver availability and loads availability events
statusReason: Error: Unable to find an element with the text: Availability for Driver 4. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:166:37
                         startTime: availability.startTime,
                         endTime: availability.endTime,
                         actions: [  
-                            { text: "Delete", variant: "danger", callback: () => {deleteDriverCallback(availability); navigate(0)} },
+                            { text: "", variant: "danger", callback: () => {deleteDriverCallback(availability); navigate(0)} },
                             { text: "Review", variant: "success", callback: () => reviewDriverCallback(availability) }
                         ]
killedBy: SchedulerPage tests driver action buttons trigger correct callbacks
statusReason: TestingLibraryElementError: Unable to find an element with the text: Delete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:170:29
                             { text: "Review", variant: "success", callback: () => reviewDriverCallback(availability) }
                         ]
                     })),
-                createLink: "/availability/create"
+                createLink: ""
             }
         }
killedBy: SchedulerPage tests navigates to driver availability and loads availability events
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create driver. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Scheduler/SchedulerPage.js:184:18
                     <Button onClick={() => {navigate('/admin/schedule/rides')}}>Ride Requests</Button>
                     <Button onClick={() => {navigate('/admin/schedule/driver')}}>Driver Availability</Button>
                 </ButtonGroup>
-                {page && eventLink().createLink && 
+                {page || eventLink().createLink && 
                     <Button
                         variant="success"
killedBy: SchedulerPage tests navigates to wrong page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-success" data-testid="SchedulerPage-create-wrong" type="button">Create wrong</button> instead

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:184:18
                     <Button onClick={() => {navigate('/admin/schedule/rides')}}>Ride Requests</Button>
                     <Button onClick={() => {navigate('/admin/schedule/driver')}}>Driver Availability</Button>
                 </ButtonGroup>
-                {page && eventLink().createLink && 
-                    <Button
-                        variant="success"
-                        data-testid={`${testId}-create-${page}`}
-                        onClick={() => navigate(eventLink().createLink)}
-                    >
-                        Create {page}
-                    </Button>
+                {true
                 }
             </Stack>
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create shifts. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:188:34
                     <Button
                         variant="success"
                         data-testid={`${testId}-create-${page}`}
-                        onClick={() => navigate(eventLink().createLink)}
+                        onClick={() => undefined}
                     >
                         Create {page}
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/shift/create"

Number of calls: 0

<html>
  <head />
