[Killed] BlockStatement
main/components/Scheduler/SchedulerEvent.js:9:44
 
     const testId = "SchedulerEvent";
 
-    const convertTimeToMinutes = (time) => {
-        const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
-        let [hours, minutes] = timePart.split(':').map(Number);
-
-        if (modifier === 'PM' && hours !== 12) {
-            hours += 12;
-        } else if (modifier === 'AM' && hours === 12) {
-            hours = 0;
-        }
-
-        return hours * 60 + minutes;
-    };
+    const convertTimeToMinutes = (time) => {};
 
     // Stryker disable all : hard to test for specfic styles
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: Unable to find an element with the text: Shift for Driver 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] UnaryOperator
main/components/Scheduler/SchedulerEvent.js:10:53
     const testId = "SchedulerEvent";
 
     const convertTimeToMinutes = (time) => {
-        const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
+        const [timePart, modifier] = [time.slice(0, +2), time.slice(-2)];
         let [hours, minutes] = timePart.split(':').map(Number);
 
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: Unable to find an element with the text: Shift for Driver 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Scheduler/SchedulerEvent.js:11:47
 
     const convertTimeToMinutes = (time) => {
         const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
-        let [hours, minutes] = timePart.split(':').map(Number);
+        let [hours, minutes] = timePart.split("").map(Number);
 
         if (modifier === 'PM' && hours !== 12) {
killedBy: SchedulerEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: Team Meeting. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-1"
      style="position: absolute; top: 154px; height: 1px; width: 100%;

[Killed] ConditionalExpression
main/components/Scheduler/SchedulerEvent.js:13:13
         const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
         let [hours, minutes] = timePart.split(':').map(Number);
 
-        if (modifier === 'PM' && hours !== 12) {
+        if (false) {
             hours += 12;
         } else if (modifier === 'AM' && hours === 12) {
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: TestingLibraryElementError: Unable to find an element with the text: Shift for Driver 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/Scheduler/SchedulerEvent.js:13:13
         const [timePart, modifier] = [time.slice(0, -2), time.slice(-2)];
         let [hours, minutes] = timePart.split(':').map(Number);
 
-        if (modifier === 'PM' && hours !== 12) {
+        if (true) {
             hours += 12;
         } else if (modifier === 'AM' && hours === 12) {
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: TestingLibraryElementError: Unable to find an element with the text: Shift for Driver 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] AssignmentOperator
main/components/Scheduler/SchedulerEvent.js:14:13
         let [hours, minutes] = timePart.split(':').map(Number);
 
         if (modifier === 'PM' && hours !== 12) {
-            hours += 12;
+            hours -= 12;
         } else if (modifier === 'AM' && hours === 12) {
             hours = 0;
killedBy: SchedulerEvents tests renders event with height from 12:00PM to 01:00PM with font size 16px
statusReason: Error: Unable to find an element with the text: Team Meeting. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-1"
      style="position: absolute; top: 814px; height: -1380px; width: 100%; background-color:

[Killed] ConditionalExpression
main/components/Scheduler/SchedulerEvent.js:15:20
 
         if (modifier === 'PM' && hours !== 12) {
             hours += 12;
-        } else if (modifier === 'AM' && hours === 12) {
+        } else if (false) {
             hours = 0;
         }
killedBy: SchedulerEvents tests renders event with height from 12:00AM to 02:00PM with font size 16px
statusReason: Error: expect(element).toHaveStyle()

- Expected

- height: 840px;
+ height: 120px;

[Killed] BlockStatement
main/components/Scheduler/SchedulerEvent.js:15:55
 
         if (modifier === 'PM' && hours !== 12) {
             hours += 12;
-        } else if (modifier === 'AM' && hours === 12) {
-            hours = 0;
-        }
+        } else if (modifier === 'AM' && hours === 12) {}
 
         return hours * 60 + minutes;
killedBy: SchedulerEvents tests renders event with height from 12:00AM to 02:00PM with font size 16px
statusReason: Error: expect(element).toHaveStyle()

- Expected

- height: 840px;
+ height: 120px;

[Killed] LogicalOperator
main/components/Scheduler/SchedulerEvent.js:72:26
                             {event.startTime} - {event.endTime}<br/>
                             {event.description}
                         </p>
-                        {event.actions && event.actions.map((action, index) => (
-                            <ButtonGroup key={index}>
-                                <Button variant={action.variant} onClick={action.callback}>{action.text}</Button>
-                            </ButtonGroup>
-                        ))}
+                        {event.actions || event.actions.map((action, index) => <ButtonGroup key={index}>
+                                <Button variant={action.variant} onClick={action.callback}>{action.text}</Button>
+                            </ButtonGroup>)}
                     </Popover.Body>
                 </Popover>
killedBy: SchedulerEvents tests renders event with correct styles and popover
statusReason: Error: Objects are not valid as a React child (found: object with keys {text, callback}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Scheduler/SchedulerEvent.js:72:26
                             {event.startTime} - {event.endTime}<br/>
                             {event.description}
                         </p>
-                        {event.actions && event.actions.map((action, index) => (
-                            <ButtonGroup key={index}>
-                                <Button variant={action.variant} onClick={action.callback}>{action.text}</Button>
-                            </ButtonGroup>
-                        ))}
+                        {false}
                     </Popover.Body>
                 </Popover>
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: Error: Unable to find an element with the text: Edit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] EqualityOperator
main/components/Scheduler/SchedulerEvent.js:83:22
         >
             <Card key={event.title} style={style.event} data-testid={`${testId}-${event.id}`}>
                 <Card.Body style={style.padding5}>
-                    {style.height >= 20 && <Card.Text data-testid={`${testId}-title`} style={style.title}>{event.title}</Card.Text>}
+                    {style.height > 20 && <Card.Text data-testid={`${testId}-title`} style={style.title}>{event.title}</Card.Text>}
                     {style.height >= 40 && <Card.Text data-testid={`${testId}-time`} style={{ fontSize: '12px', textAlign: 'left' }}>{event.startTime} - {event.endTime}</Card.Text>}
                 </Card.Body>
killedBy: SchedulerEvents tests renders event with height from 12:00PM to 12:20PM with font size 10px
statusReason: Error: Unable to find an element with the text: Team Meeting. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-1"
      style="position: absolute; top: 814px; height: 20px; width: 100%; background-color: li

[Killed] ConditionalExpression
main/components/Scheduler/SchedulerEvent.js:83:22
         >
             <Card key={event.title} style={style.event} data-testid={`${testId}-${event.id}`}>
                 <Card.Body style={style.padding5}>
-                    {style.height >= 20 && <Card.Text data-testid={`${testId}-title`} style={style.title}>{event.title}</Card.Text>}
+                    {true && <Card.Text data-testid={`${testId}-title`} style={style.title}>{event.title}</Card.Text>}
                     {style.height >= 40 && <Card.Text data-testid={`${testId}-time`} style={{ fontSize: '12px', textAlign: 'left' }}>{event.startTime} - {event.endTime}</Card.Text>}
                 </Card.Body>
killedBy: SchedulerPage tests navigates to ride requests and loads ride events
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Scheduler/SchedulerEvent.js:84:22
             <Card key={event.title} style={style.event} data-testid={`${testId}-${event.id}`}>
                 <Card.Body style={style.padding5}>
                     {style.height >= 20 && <Card.Text data-testid={`${testId}-title`} style={style.title}>{event.title}</Card.Text>}
-                    {style.height >= 40 && <Card.Text data-testid={`${testId}-time`} style={{ fontSize: '12px', textAlign: 'left' }}>{event.startTime} - {event.endTime}</Card.Text>}
+                    {false}
                 </Card.Body>
             </Card>
killedBy: SchedulerEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: 10:00AM - 11:00AM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-1"
      style="position: absolute; top: 694px; height: 60px; width:

[Killed] ConditionalExpression
main/components/Scheduler/SchedulerEvent.js:84:22
             <Card key={event.title} style={style.event} data-testid={`${testId}-${event.id}`}>
                 <Card.Body style={style.padding5}>
                     {style.height >= 20 && <Card.Text data-testid={`${testId}-title`} style={style.title}>{event.title}</Card.Text>}
-                    {style.height >= 40 && <Card.Text data-testid={`${testId}-time`} style={{ fontSize: '12px', textAlign: 'left' }}>{event.startTime} - {event.endTime}</Card.Text>}
+                    {true}
                 </Card.Body>
             </Card>
killedBy: SchedulerEvents tests renders event with correct styles and popover
statusReason: TestingLibraryElementError: Unable to find an element with the text: 10:00AM - 11:00AM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
      data-testid="SchedulerEvent-1"
      style="position: absolute; top: 694px; height: 60px; width:
