[Killed] StringLiteral
main/components/Scheduler/SchedulerPanel.js:8:41
 const daysOfWeek = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'];
 
 const hours = [
-    '', '1 AM', '2 AM', '3 AM', '4 AM', '5 AM', '6 AM', 
+    '', '1 AM', '2 AM', '3 AM', '4 AM', "", '6 AM', 
     '7 AM', '8 AM', '9 AM', '10 AM', '11 AM', '12 PM', 
     '1 PM', '2 PM', '3 PM', '4 PM', '5 PM', '6 PM', 
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SchedulerPanel--title"]

Here are the matching elements:

<div
  data-testid="SchedulerPanel--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"
>

[Killed] StringLiteral
main/components/Scheduler/SchedulerPanel.js:8:5
 const daysOfWeek = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'];
 
 const hours = [
-    '', '1 AM', '2 AM', '3 AM', '4 AM', '5 AM', '6 AM', 
+    "Stryker was here!", '1 AM', '2 AM', '3 AM', '4 AM', '5 AM', '6 AM', 
     '7 AM', '8 AM', '9 AM', '10 AM', '11 AM', '12 PM', 
     '1 PM', '2 PM', '3 PM', '4 PM', '5 PM', '6 PM', 
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel--title"]

<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"
    >

[Killed] StringLiteral
main/components/Scheduler/SchedulerPanel.js:9:47
 
 const hours = [
     '', '1 AM', '2 AM', '3 AM', '4 AM', '5 AM', '6 AM', 
-    '7 AM', '8 AM', '9 AM', '10 AM', '11 AM', '12 PM', 
+    '7 AM', '8 AM', '9 AM', '10 AM', '11 AM', "", 
     '1 PM', '2 PM', '3 PM', '4 PM', '5 PM', '6 PM', 
     '7 PM', '8 PM', '9 PM', '10 PM', '11 PM'
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SchedulerPanel--title"]

Here are the matching elements:

<div
  data-testid="SchedulerPanel--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"
>

[Killed] StringLiteral
main/components/Scheduler/SchedulerPanel.js:9:5
 
 const hours = [
     '', '1 AM', '2 AM', '3 AM', '4 AM', '5 AM', '6 AM', 
-    '7 AM', '8 AM', '9 AM', '10 AM', '11 AM', '12 PM', 
+    "", '8 AM', '9 AM', '10 AM', '11 AM', '12 PM', 
     '1 PM', '2 PM', '3 PM', '4 PM', '5 PM', '6 PM', 
     '7 PM', '8 PM', '9 PM', '10 PM', '11 PM'
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SchedulerPanel--title"]

Here are the matching elements:

<div
  data-testid="SchedulerPanel--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"
>

[Killed] StringLiteral
main/components/Scheduler/SchedulerPanel.js:10:5
 const hours = [
     '', '1 AM', '2 AM', '3 AM', '4 AM', '5 AM', '6 AM', 
     '7 AM', '8 AM', '9 AM', '10 AM', '11 AM', '12 PM', 
-    '1 PM', '2 PM', '3 PM', '4 PM', '5 PM', '6 PM', 
+    "", '2 PM', '3 PM', '4 PM', '5 PM', '6 PM', 
     '7 PM', '8 PM', '9 PM', '10 PM', '11 PM'
 ];
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SchedulerPanel--title"]

Here are the matching elements:

<div
  data-testid="SchedulerPanel--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"
>

[Killed] StringLiteral
main/components/Scheduler/SchedulerPanel.js:10:13
 const hours = [
     '', '1 AM', '2 AM', '3 AM', '4 AM', '5 AM', '6 AM', 
     '7 AM', '8 AM', '9 AM', '10 AM', '11 AM', '12 PM', 
-    '1 PM', '2 PM', '3 PM', '4 PM', '5 PM', '6 PM', 
+    '1 PM', "", '3 PM', '4 PM', '5 PM', '6 PM', 
     '7 PM', '8 PM', '9 PM', '10 PM', '11 PM'
 ];
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SchedulerPanel--title"]

Here are the matching elements:

<div
  data-testid="SchedulerPanel--title"
  style="height: 60px; display: flex; align-items: center; justify-content: center; position: relative; border: 0px;"
>

[Killed] StringLiteral
main/components/Scheduler/SchedulerPanel.js:25:20
 // Stryker disable next-line all : no need to test default colors
 export default function SchedulerPanel({ Events = [], eventColor="#d1ecf188", borderColor="#bee5eb"}) {
 
-    const testId = "SchedulerPanel";
+    const testId = "";
 
     return (
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-Monday-title"]

<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"
    >

[Killed] ArrowFunction
main/components/Scheduler/SchedulerPanel.js:31:33
         <Container fluid style={styles.schedulerPanel}>
             <Row style={styles.headerRow}>
                 <Col style={styles.timeColumn}></Col>
-                {daysOfWeek.map(day => (
-                    <Col key={day} style={styles.dayColumn} data-testid={`${testId}-${day}-column`}>
-                        <Card style={styles.dayCard}>
-                            <Card.Body>
-                                <Card.Title style={styles.dayTitle} data-testid={`${testId}-${day}-title`}>{day}</Card.Title>
-                            </Card.Body>
-                            {Events
-                                .filter(event => event.day === day)
-                                .map(event => (
-                                <SchedulerEvents key={event.id} event={event} eventColor={eventColor} borderColor={borderColor}/>
-                            ))}
-                        </Card>
-                    </Col>
-                ))}
+                {daysOfWeek.map(() => undefined)}
             </Row>
             <Row>
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-Monday-title"]

<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"
    >

[Killed] MethodExpression
main/components/Scheduler/SchedulerPanel.js:37:30
                             <Card.Body>
                                 <Card.Title style={styles.dayTitle} data-testid={`${testId}-${day}-title`}>{day}</Card.Title>
                             </Card.Body>
-                            {Events
-                                .filter(event => event.day === day)
+                            {Events
                                 .map(event => (
                                 <SchedulerEvents key={event.id} event={event} eventColor={eventColor} borderColor={borderColor}/>
killedBy: SchedulerPanel tests renders events on correct days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 7

[Killed] ArrowFunction
main/components/Scheduler/SchedulerPanel.js:38:41
                                 <Card.Title style={styles.dayTitle} data-testid={`${testId}-${day}-title`}>{day}</Card.Title>
                             </Card.Body>
                             {Events
-                                .filter(event => event.day === day)
+                                .filter(() => undefined)
                                 .map(event => (
                                 <SchedulerEvents key={event.id} event={event} eventColor={eventColor} borderColor={borderColor}/>
killedBy: SchedulerPanel tests renders events on correct days
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEvent-1"]

<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"
    >

[Killed] EqualityOperator
main/components/Scheduler/SchedulerPanel.js:38:50
                                 <Card.Title style={styles.dayTitle} data-testid={`${testId}-${day}-title`}>{day}</Card.Title>
                             </Card.Body>
                             {Events
-                                .filter(event => event.day === day)
+                                .filter(event => event.day !== day)
                                 .map(event => (
                                 <SchedulerEvents key={event.id} event={event} eventColor={eventColor} borderColor={borderColor}/>
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: Found multiple elements with the text: Shift for Driver 1

Here are the matching elements:

<p
  class="card-text"
  data-testid="SchedulerEvent-title"
  style="font-size: 16px; overflow: hidden; white-space: nowrap; text-overflow: ellipsis; text-align: left; margin: 0px;"

[Killed] ArrowFunction
main/components/Scheduler/SchedulerPanel.js:39:38
                             </Card.Body>
                             {Events
                                 .filter(event => event.day === day)
-                                .map(event => (
-                                <SchedulerEvents key={event.id} event={event} eventColor={eventColor} borderColor={borderColor}/>
-                            ))}
+                                .map(() => undefined)}
                         </Card>
                     </Col>
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: Unable to find an element with the text: Shift for Driver 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/components/Scheduler/SchedulerPanel.js:50:32
                 <Col style={styles.timeColumn}>
                     {/* Stryker disable next-line all : no test needed for styling */
                     <div style={{...styles.timeSlot, height: "30px", border: "0"}}></div>}
-                    {hours.map((hour, index) => (
-                        /* Stryker disable next-line all : no test needed for styling */
-                        <div key={index} style={{...styles.timeSlot, border: "0"}} data-testid={`${testId}-${hour.replace(' ', '-')}-title`}>
-                            <span style={styles.hourLabel} data-testid={`${testId}-${hour.replace(' ', '-')}-label`}>{hour}</span>
-                        </div>
-                    ))}
+                    {hours.map(() => undefined)}
                 </Col>
                 {daysOfWeek.map(day => (
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel--title"]

<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"
    >

[Killed] ArrowFunction
main/components/Scheduler/SchedulerPanel.js:57:33
                         </div>
                     ))}
                 </Col>
-                {daysOfWeek.map(day => (
-                    <Col key={day} style={styles.dayColumn}>
-                        {/* Stryker disable next-line all : no test needed for styling */
-                        <div style={{...styles.timeSlot, height: "30px"}}></div>}
-                        {hours.slice(0, hours.length-1).map(hour => (
-                            <div key={hour} style={styles.timeSlot} data-testid={`${testId}-base-slot`}>
-                                <Card style={styles.eventCard}/>
-                            </div>
-                        ))}
-                    </Col>
-                ))}
+                {daysOfWeek.map(() => undefined)}
             </Row>
         </Container>
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-base-slot"]

<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"
    >

[Killed] MethodExpression
main/components/Scheduler/SchedulerPanel.js:61:26
                     <Col key={day} style={styles.dayColumn}>
                         {/* Stryker disable next-line all : no test needed for styling */
                         <div style={{...styles.timeSlot, height: "30px"}}></div>}
-                        {hours.slice(0, hours.length-1).map(hour => (
+                        {hours.map(hour => (
                             <div key={hour} style={styles.timeSlot} data-testid={`${testId}-base-slot`}>
                                 <Card style={styles.eventCard}/>
killedBy: SchedulerPanel tests renders without crashing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 161
Received: 168

[Killed] ArrowFunction
main/components/Scheduler/SchedulerPanel.js:61:61
                     <Col key={day} style={styles.dayColumn}>
                         {/* Stryker disable next-line all : no test needed for styling */
                         <div style={{...styles.timeSlot, height: "30px"}}></div>}
-                        {hours.slice(0, hours.length-1).map(hour => (
-                            <div key={hour} style={styles.timeSlot} data-testid={`${testId}-base-slot`}>
-                                <Card style={styles.eventCard}/>
-                            </div>
-                        ))}
+                        {hours.slice(0, hours.length-1).map(() => undefined)}
                     </Col>
                 ))}
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-base-slot"]

<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"
    >

[Killed] StringLiteral
main/components/Scheduler/SchedulerPanel.js:62:82
                         {/* Stryker disable next-line all : no test needed for styling */
                         <div style={{...styles.timeSlot, height: "30px"}}></div>}
                         {hours.slice(0, hours.length-1).map(hour => (
-                            <div key={hour} style={styles.timeSlot} data-testid={`${testId}-base-slot`}>
+                            <div key={hour} style={styles.timeSlot} data-testid={``}>
                                 <Card style={styles.eventCard}/>
                             </div>
killedBy: SchedulerPanel tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerPanel-base-slot"]

<body>
  <div>
    <div
      class="container-fluid"
      style="background-color: rgb(255, 255, 255); padding: 20px;"
    >
