[Killed] BlockStatement
main/pages/Drivers/DriverAvailabilityIndexPageAdmin.js:9:55
 import { useCurrentUser } from 'main/utils/currentUser'
 // import { Button } from 'react-bootstrap';
 
-export default function DriverAvailabilityIndexPage() {
-
-    const currentUser = useCurrentUser();
-
-    const { data: availabilities, error: _error, status: _status } =
-        useBackend(
-            // Stryker disable all : hard to test for query caching
-            ["/api/driverAvailability/admin/all"],
-            { method: "GET", url: "/api/driverAvailability/admin/all" },
-            []
-            // Stryker restore all 
-        );
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Driver Availabilities</h1>
-                <DriverAvailabilityTable Availability={availabilities} currentUser={currentUser} />
-            </div>
-        </BasicLayout>
-    );
-}
+export default function DriverAvailabilityIndexPage() {}
killedBy: DriverAvailabilityIndexPageAdmin tests fetches driver availabilities using the correct GET method
statusReason: Error: DriverAvailabilityIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
