[Killed] ObjectLiteral
main/pages/Scheduler/SchedulerPage.js:29:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/shift/all`],
-            {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/shift/all`
-                // Stryker restore all
-            },
+            {},
         );
 
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: Unable to find an element with the text: Shift for Driver 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:36:42
             },
         );
 
-    const editShiftCallback = (shift) => {
-        navigate(`/shift/edit/${shift.id}`)
-    }
+    const editShiftCallback = (shift) => {}
 
     const infoShiftCallback = (shift) => {
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/shift/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:40:42
         navigate(`/shift/edit/${shift.id}`)
     }
 
-    const infoShiftCallback = (shift) => {
-        navigate(`/shiftInfo/${shift.id}`)
-    }
+    const infoShiftCallback = (shift) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/shiftInfo/1"
Received: "/shift/edit/1"

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:41:18
     }
 
     const infoShiftCallback = (shift) => {
-        navigate(`/shiftInfo/${shift.id}`)
+        navigate(``)
     }
 
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/shiftInfo/1"
Received
       1: "/shift/edit/1"
       2: ""

Number of calls: 2

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:65:22
             [`/api/ride_request/all`],
             {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
                 method: "GET",
-                url: `/api/ride_request/all`
+                url: ``
                 // Stryker restore all
             },
killedBy: SchedulerPage tests navigates to ride requests and loads ride events
statusReason: Error: Unable to find an element with the text: Ride Request for CGaucho. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:70:40
             },
         );
 
-    const editRideCallback = (ride) => {
-        navigate(`/ride/edit/${ride.id}`)
-    }
+    const editRideCallback = (ride) => {}
 
     const assignRideCallback = (ride) => {
killedBy: SchedulerPage tests ride action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:74:42
         navigate(`/ride/edit/${ride.id}`)
     }
 
-    const assignRideCallback = (ride) => {
-        navigate(`/ride/assigndriver/${ride.id}`)
-    }
+    const assignRideCallback = (ride) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: SchedulerPage tests ride action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride/assigndriver/2"
Received
       1: "/ride/edit/2"
       2: 0

Number of calls: 2

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:104:46
             },
         );
 
-    const reviewDriverCallback = (driver) => {
-        navigate(`/admin/availability/review/${driver.id}`)
-    }
+    const reviewDriverCallback = (driver) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: SchedulerPage tests driver action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/availability/review/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:105:18
         );
 
     const reviewDriverCallback = (driver) => {
-        navigate(`/admin/availability/review/${driver.id}`)
+        navigate(``)
     }
 
killedBy: SchedulerPage tests driver action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/availability/review/1"
Received: ""

Number of calls: 1

<html>

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:121:12
     const deleteDriverCallback = async (driver) => { DriverDeleteMutation.mutate({row: {values: {id: driver.id}}}); }
 
     function onUpdateEvents(){
-        if(page === "shifts") {
+        if(false) {
             if(shifts === undefined) return;
             setEvents(shifts.map(shift => ({
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: Unable to find an element with the text: Shift for Driver 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:121:12
     const deleteDriverCallback = async (driver) => { DriverDeleteMutation.mutate({row: {values: {id: driver.id}}}); }
 
     function onUpdateEvents(){
-        if(page === "shifts") {
+        if(true) {
             if(shifts === undefined) return;
             setEvents(shifts.map(shift => ({
killedBy: SchedulerPage tests navigates to wrong page
statusReason: Error: expect(element).not.toBeInTheDocument()


<html>
  <head />
  <body>
    <div>

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:122:16
 
     function onUpdateEvents(){
         if(page === "shifts") {
-            if(shifts === undefined) return;
+            if(false) return;
             setEvents(shifts.map(shift => ({
                 id: shift.id,
killedBy: SchedulerPage if backend is not working navigates to shifts and loads shift events
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:122:16
 
     function onUpdateEvents(){
         if(page === "shifts") {
-            if(shifts === undefined) return;
+            if(true) return;
             setEvents(shifts.map(shift => ({
                 id: shift.id,
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: Unable to find an element with the text: Shift for Driver 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:123:34
     function onUpdateEvents(){
         if(page === "shifts") {
             if(shifts === undefined) return;
-            setEvents(shifts.map(shift => ({
-                id: shift.id,
-                title: `Shift for Driver ${shift.driverID}`,
-                // Stryker disable next-line all : hard to test for specific description
-                description: `Backup Driver: ${shift.driverBackupID}`,
-                day: shift.day,
-                startTime: shift.shiftStart,
-                endTime: shift.shiftEnd,
-                actions: [
-                    { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
-                    { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
-                    { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
-                ]
-            })));
+            setEvents(shifts.map(() => undefined));
             setCreateLink("/shift/create");
         }
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: TypeError: Cannot read properties of undefined (reading 'day')

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:132:67
                 startTime: shift.shiftStart,
                 endTime: shift.shiftEnd,
                 actions: [
-                    { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
+                    { text: "Edit", variant: "primary", callback: () => undefined },
                     { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
                     { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/shift/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:133:74
                 endTime: shift.shiftEnd,
                 actions: [
                     { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
-                    { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
+                    { text: "Delete", variant: "danger", callback: () => {} },
                     { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
                 ]
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:133:29
                 endTime: shift.shiftEnd,
                 actions: [
                     { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
-                    { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
+                    { text: "", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
                     { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
                 ]
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: TestingLibraryElementError: Unable to find an element with the text: Delete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:134:67
                 actions: [
                     { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
                     { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
-                    { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
+                    { text: "Info", variant: "success", callback: () => undefined }
                 ]
             })));
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/shiftInfo/1"
Received: "/shift/edit/1"

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:134:46
                 actions: [
                     { text: "Edit", variant: "primary", callback: () => editShiftCallback(shift) },
                     { text: "Delete", variant: "danger", callback: () => {deleteShiftCallback(shift); navigate(0)} },
-                    { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
+                    { text: "Info", variant: "", callback: () => infoShiftCallback(shift) }
                 ]
             })));
killedBy: SchedulerPage tests shift action buttons trigger correct callbacks
statusReason: Error: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:137:27
                     { text: "Info", variant: "success", callback: () => infoShiftCallback(shift) }
                 ]
             })));
-            setCreateLink("/shift/create");
+            setCreateLink("");
         }
         else if(page === "rides") {
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create shifts. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:139:35
             })));
             setCreateLink("/shift/create");
         }
-        else if(page === "rides") {
-            if(ride_request === undefined) return;
-            setEvents(ride_request.map(request => ({
-                id: request.id,
-                title: `Ride Request for ${request.student}`,
-                // Stryker disable next-line all : hard to test for specific description
-                description: `From ${request.pickupBuilding} to ${request.dropoffBuilding}`,
-                day: request.day,
-                startTime: request.startTime,
-                endTime: request.endTime,
-                actions: [
-                    { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
-                    { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
-                    { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
-                ]
-            })));
-            setCreateLink("/ride/create");
-        }
+        else if(page === "rides") {}
         else if(page === "driver") {
             if(driverAvailability === undefined) return;
killedBy: SchedulerPage tests navigates to ride requests and loads ride events
statusReason: Error: Unable to find an element with the text: Ride Request for CGaucho. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] EqualityOperator
main/pages/Scheduler/SchedulerPage.js:139:17
             })));
             setCreateLink("/shift/create");
         }
-        else if(page === "rides") {
+        else if(page !== "rides") {
             if(ride_request === undefined) return;
             setEvents(ride_request.map(request => ({
killedBy: SchedulerPage tests navigates to wrong page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-success" data-testid="SchedulerPage-create-wrong" type="button">Create wrong</button> instead

[Killed] EqualityOperator
main/pages/Scheduler/SchedulerPage.js:140:16
             setCreateLink("/shift/create");
         }
         else if(page === "rides") {
-            if(ride_request === undefined) return;
+            if(ride_request !== undefined) return;
             setEvents(ride_request.map(request => ({
                 id: request.id,
killedBy: SchedulerPage if backend is not working navigates to ride requests and loads ride events
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:140:16
             setCreateLink("/shift/create");
         }
         else if(page === "rides") {
-            if(ride_request === undefined) return;
+            if(false) return;
             setEvents(ride_request.map(request => ({
                 id: request.id,
killedBy: SchedulerPage if backend is not working navigates to ride requests and loads ride events
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:141:40
         }
         else if(page === "rides") {
             if(ride_request === undefined) return;
-            setEvents(ride_request.map(request => ({
-                id: request.id,
-                title: `Ride Request for ${request.student}`,
-                // Stryker disable next-line all : hard to test for specific description
-                description: `From ${request.pickupBuilding} to ${request.dropoffBuilding}`,
-                day: request.day,
-                startTime: request.startTime,
-                endTime: request.endTime,
-                actions: [
-                    { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
-                    { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
-                    { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
-                ]
-            })));
+            setEvents(ride_request.map(() => undefined));
             setCreateLink("/ride/create");
         }
killedBy: SchedulerPage tests navigates to ride requests and loads ride events
statusReason: TypeError: Cannot read properties of undefined (reading 'day')

[Killed] ObjectLiteral
main/pages/Scheduler/SchedulerPage.js:141:52
         }
         else if(page === "rides") {
             if(ride_request === undefined) return;
-            setEvents(ride_request.map(request => ({
-                id: request.id,
-                title: `Ride Request for ${request.student}`,
-                // Stryker disable next-line all : hard to test for specific description
-                description: `From ${request.pickupBuilding} to ${request.dropoffBuilding}`,
-                day: request.day,
-                startTime: request.startTime,
-                endTime: request.endTime,
-                actions: [
-                    { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
-                    { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
-                    { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
-                ]
-            })));
+            setEvents(ride_request.map(request => ({})));
             setCreateLink("/ride/create");
         }
killedBy: SchedulerPage tests navigates to ride requests and loads ride events
statusReason: Error: Unable to find an element with the text: Ride Request for CGaucho. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:150:67
                 startTime: request.startTime,
                 endTime: request.endTime,
                 actions: [
-                    { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
+                    { text: "Edit", variant: "primary", callback: () => undefined },
                     { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
                     { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
killedBy: SchedulerPage tests ride action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:151:74
                 endTime: request.endTime,
                 actions: [
                     { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
-                    { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
+                    { text: "Delete", variant: "danger", callback: () => {} },
                     { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
                 ]
killedBy: SchedulerPage tests ride action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:152:76
                 actions: [
                     { text: "Edit", variant: "primary", callback: () => editRideCallback(request) },
                     { text: "Delete", variant: "danger", callback: () => {deleteRideCallback(request); navigate(0)} },
-                    { text: "Assign Driver", variant: "success", callback: () => assignRideCallback(request) }
+                    { text: "Assign Driver", variant: "success", callback: () => undefined }
                 ]
             })));
killedBy: SchedulerPage tests ride action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ride/assigndriver/2"
Received
       1: "/ride/edit/2"
       2: 0

Number of calls: 2

[Killed] EqualityOperator
main/pages/Scheduler/SchedulerPage.js:157:17
             })));
             setCreateLink("/ride/create");
         }
-        else if(page === "driver") {
+        else if(page !== "driver") {
             if(driverAvailability === undefined) return;
             setEvents(driverAvailability.map(availability => ({
killedBy: SchedulerPage tests navigates to wrong page
statusReason: Error: expect(element).not.toBeInTheDocument()


<html>
  <head />
  <body>
    <div>

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:157:17
             })));
             setCreateLink("/ride/create");
         }
-        else if(page === "driver") {
+        else if(false) {
             if(driverAvailability === undefined) return;
             setEvents(driverAvailability.map(availability => ({
killedBy: SchedulerPage tests navigates to driver availability and loads availability events
statusReason: Error: Unable to find an element with the text: Availability for Driver 4. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:158:16
             setCreateLink("/ride/create");
         }
         else if(page === "driver") {
-            if(driverAvailability === undefined) return;
+            if(false) return;
             setEvents(driverAvailability.map(availability => ({
                 id: availability.id,
killedBy: SchedulerPage if backend is not working navigates to driver availability and loads availability events
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] EqualityOperator
main/pages/Scheduler/SchedulerPage.js:158:16
             setCreateLink("/ride/create");
         }
         else if(page === "driver") {
-            if(driverAvailability === undefined) return;
+            if(driverAvailability !== undefined) return;
             setEvents(driverAvailability.map(availability => ({
                 id: availability.id,
killedBy: SchedulerPage if backend is not working navigates to driver availability and loads availability events
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:159:46
         }
         else if(page === "driver") {
             if(driverAvailability === undefined) return;
-            setEvents(driverAvailability.map(availability => ({
-                id: availability.id,
-                title: `Availability for Driver ${availability.driverId}`,
-                description: availability.notes,
-                day: availability.day,
-                startTime: availability.startTime,
-                endTime: availability.endTime,
-                actions: [  
-                    { text: "Delete", variant: "danger", callback: () => {deleteDriverCallback(availability); navigate(0)} },
-                    { text: "Review", variant: "success", callback: () => reviewDriverCallback(availability) }
-                ]
-            })));
+            setEvents(driverAvailability.map(() => undefined));
             setCreateLink("/availability/create");
         }
killedBy: SchedulerPage tests navigates to driver availability and loads availability events
statusReason: TypeError: Cannot read properties of undefined (reading 'day')

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:167:74
                 startTime: availability.startTime,
                 endTime: availability.endTime,
                 actions: [  
-                    { text: "Delete", variant: "danger", callback: () => {deleteDriverCallback(availability); navigate(0)} },
+                    { text: "Delete", variant: "danger", callback: () => {} },
                     { text: "Review", variant: "success", callback: () => reviewDriverCallback(availability) }
                 ]
killedBy: SchedulerPage tests driver action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:167:48
                 startTime: availability.startTime,
                 endTime: availability.endTime,
                 actions: [  
-                    { text: "Delete", variant: "danger", callback: () => {deleteDriverCallback(availability); navigate(0)} },
+                    { text: "Delete", variant: "", callback: () => {deleteDriverCallback(availability); navigate(0)} },
                     { text: "Review", variant: "success", callback: () => reviewDriverCallback(availability) }
                 ]
killedBy: SchedulerPage tests driver action buttons trigger correct callbacks
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:168:69
                 endTime: availability.endTime,
                 actions: [  
                     { text: "Delete", variant: "danger", callback: () => {deleteDriverCallback(availability); navigate(0)} },
-                    { text: "Review", variant: "success", callback: () => reviewDriverCallback(availability) }
+                    { text: "Review", variant: "success", callback: () => undefined }
                 ]
             })));
killedBy: SchedulerPage tests driver action buttons trigger correct callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/availability/review/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:168:48
                 endTime: availability.endTime,
                 actions: [  
                     { text: "Delete", variant: "danger", callback: () => {deleteDriverCallback(availability); navigate(0)} },
-                    { text: "Review", variant: "success", callback: () => reviewDriverCallback(availability) }
+                    { text: "Review", variant: "", callback: () => reviewDriverCallback(availability) }
                 ]
             })));
killedBy: SchedulerPage tests driver action buttons trigger correct callbacks
statusReason: Error: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:185:44
         <BasicLayout>
             <Stack className="flex-row justify-content-between">
                 <ButtonGroup>
-                    <Button onClick={() => {navigate('/admin/schedule/shifts')}}>Shifts</Button>
+                    <Button onClick={() => {}}>Shifts</Button>
                     <Button onClick={() => {navigate('/admin/schedule/rides')}}>Ride Requests</Button>
                     <Button onClick={() => {navigate('/admin/schedule/driver')}}>Driver Availability</Button>
killedBy: SchedulerPage tests renders default without crashing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/schedule/shifts"

Number of calls: 0

<html>
  <head />
