[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:185:54
         <BasicLayout>
             <Stack className="flex-row justify-content-between">
                 <ButtonGroup>
-                    <Button onClick={() => {navigate('/admin/schedule/shifts')}}>Shifts</Button>
+                    <Button onClick={() => {navigate("")}}>Shifts</Button>
                     <Button onClick={() => {navigate('/admin/schedule/rides')}}>Ride Requests</Button>
                     <Button onClick={() => {navigate('/admin/schedule/driver')}}>Driver Availability</Button>
killedBy: SchedulerPage tests renders default without crashing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/schedule/shifts"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:186:44
             <Stack className="flex-row justify-content-between">
                 <ButtonGroup>
                     <Button onClick={() => {navigate('/admin/schedule/shifts')}}>Shifts</Button>
-                    <Button onClick={() => {navigate('/admin/schedule/rides')}}>Ride Requests</Button>
+                    <Button onClick={() => {}}>Ride Requests</Button>
                     <Button onClick={() => {navigate('/admin/schedule/driver')}}>Driver Availability</Button>
                 </ButtonGroup>
killedBy: SchedulerPage tests renders default without crashing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/schedule/rides"
Received: "/admin/schedule/shifts"

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Scheduler/SchedulerPage.js:186:54
             <Stack className="flex-row justify-content-between">
                 <ButtonGroup>
                     <Button onClick={() => {navigate('/admin/schedule/shifts')}}>Shifts</Button>
-                    <Button onClick={() => {navigate('/admin/schedule/rides')}}>Ride Requests</Button>
+                    <Button onClick={() => {navigate("")}}>Ride Requests</Button>
                     <Button onClick={() => {navigate('/admin/schedule/driver')}}>Driver Availability</Button>
                 </ButtonGroup>
killedBy: SchedulerPage tests renders default without crashing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/schedule/rides"
Received
       1: "/admin/schedule/shifts"
       2: ""

Number of calls: 2

[Killed] BlockStatement
main/pages/Scheduler/SchedulerPage.js:187:44
                 <ButtonGroup>
                     <Button onClick={() => {navigate('/admin/schedule/shifts')}}>Shifts</Button>
                     <Button onClick={() => {navigate('/admin/schedule/rides')}}>Ride Requests</Button>
-                    <Button onClick={() => {navigate('/admin/schedule/driver')}}>Driver Availability</Button>
+                    <Button onClick={() => {}}>Driver Availability</Button>
                 </ButtonGroup>
                 {page && createLink && 
killedBy: SchedulerPage tests renders default without crashing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/schedule/driver"
Received
       1: "/admin/schedule/shifts"
       2: "/admin/schedule/rides"

Number of calls: 2

[Killed] LogicalOperator
main/pages/Scheduler/SchedulerPage.js:189:18
                     <Button onClick={() => {navigate('/admin/schedule/rides')}}>Ride Requests</Button>
                     <Button onClick={() => {navigate('/admin/schedule/driver')}}>Driver Availability</Button>
                 </ButtonGroup>
-                {page && createLink && 
+                {page || createLink && 
                     <Button
                         variant="success"
killedBy: SchedulerPage tests navigates to wrong page
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-success" data-testid="SchedulerPage-create-wrong" type="button">Create wrong</button> instead

[Killed] ConditionalExpression
main/pages/Scheduler/SchedulerPage.js:189:18
                     <Button onClick={() => {navigate('/admin/schedule/rides')}}>Ride Requests</Button>
                     <Button onClick={() => {navigate('/admin/schedule/driver')}}>Driver Availability</Button>
                 </ButtonGroup>
-                {page && createLink && 
-                    <Button
-                        variant="success"
-                        data-testid={`${testId}-create-${page}`}
-                        onClick={() => navigate(createLink)}
-                    >
-                        Create {page}
-                    </Button>
+                {true
                 }
             </Stack>
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create shifts. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Scheduler/SchedulerPage.js:193:34
                     <Button
                         variant="success"
                         data-testid={`${testId}-create-${page}`}
-                        onClick={() => navigate(createLink)}
+                        onClick={() => undefined}
                     >
                         Create {page}
killedBy: SchedulerPage tests navigates to shifts and loads shift events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/shift/create"

Number of calls: 0

<html>
  <head />
